<a href="https://colab.research.google.com/github/shindhuja2501/broadcasting/blob/master/dataframe.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [0]:
import numpy as np

In [0]:
import pandas as pd

In [0]:
s=pd.Series(['s','h','i','n','d','h','u','j','a'],index=[1,2,3,4,5,6,7,8,9])

In [8]:
s

1    s
2    h
3    i
4    n
5    d
6    h
7    u
8    j
9    a
dtype: object

In [0]:
x=pd.DataFrame({"Name":["Shindhuja","Haseena","Ragavi","Kavya","Ashi","Saranya","Anitha","Dharani","Dhivya","Rangeela"],"Age":[i for i in range(0,10)],"Height":[i for i in range(0,10)],"Weight":[i for i in range(0,10)]})

In [10]:
x

   Age  Height       Name  Weight
0    0       0  Shindhuja       0
1    1       1    Haseena       1
2    2       2     Ragavi       2
3    3       3      Kavya       3
4    4       4       Ashi       4
5    5       5    Saranya       5
6    6       6     Anitha       6
7    7       7    Dharani       7
8    8       8     Dhivya       8
9    9       9   Rangeela       9

In [11]:
x[["Name","Age","Height","Weight"]]

        Name  Age  Height  Weight
0  Shindhuja    0       0       0
1    Haseena    1       1       1
2     Ragavi    2       2       2
3      Kavya    3       3       3
4       Ashi    4       4       4
5    Saranya    5       5       5
6     Anitha    6       6       6
7    Dharani    7       7       7
8     Dhivya    8       8       8
9   Rangeela    9       9       9

In [12]:
x['Name']

0    Shindhuja
1      Haseena
2       Ragavi
3        Kavya
4         Ashi
5      Saranya
6       Anitha
7      Dharani
8       Dhivya
9     Rangeela
Name: Name, dtype: object

In [13]:
x.values

array([[0, 0, 'Shindhuja', 0],
       [1, 1, 'Haseena', 1],
       [2, 2, 'Ragavi', 2],
       [3, 3, 'Kavya', 3],
       [4, 4, 'Ashi', 4],
       [5, 5, 'Saranya', 5],
       [6, 6, 'Anitha', 6],
       [7, 7, 'Dharani', 7],
       [8, 8, 'Dhivya', 8],
       [9, 9, 'Rangeela', 9]], dtype=object)

In [14]:
x.Age

0    0
1    1
2    2
3    3
4    4
5    5
6    6
7    7
8    8
9    9
Name: Age, dtype: int64

In [15]:
x.Name

0    Shindhuja
1      Haseena
2       Ragavi
3        Kavya
4         Ashi
5      Saranya
6       Anitha
7      Dharani
8       Dhivya
9     Rangeela
Name: Name, dtype: object

In [16]:
x.Name[0]

'Shindhuja'

In [0]:
y=pd.DataFrame({"City":["Salem","Erode","Salem","Theni","Chennai","Salem","Trichy","Erode","Madurai","Chennai"]})

In [20]:
y

      City
0    Salem
1    Erode
2    Salem
3    Theni
4  Chennai
5    Salem
6   Trichy
7    Erode
8  Madurai
9  Chennai